artillery.yml
# Artillery Load Testing Configuration
config:
  target: 'http://localhost:8080'
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    
    # Cool-down
    - duration: 30
      arrivalRate: 10
      name: "Cool-down"

  # Environment variables
  environments:
    production:
      target: 'https://your-domain.com'
    staging:
      target: 'https://staging.your-domain.com'

  # Payload configuration
  payload:
    - path: './test-data/users.csv'
      fields:
        - 'email'
        - 'password'

  # Custom metrics
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

  # Request defaults
  defaults:
    headers:
      'User-Agent': 'Artillery Load Test'
      'Accept': 'application/json, text/html'

scenarios:
  # Test homepage performance
  - name: "Homepage Load Test"
    weight: 30
    flow:
      - get:
          url: "/"
          capture:
            - regexp: "<title>(.*?)</title>"
              as: "pageTitle"
      - think: 3
      - get:
          url: "/about"
      - think: 2

  # Test authentication flow
  - name: "Authentication Flow"
    weight: 20
    flow:
      - get:
          url: "/auth"
      - think: 2
      - post:
          url: "/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - header: "set-cookie"
              as: "sessionCookie"
      - think: 1

  # Test dashboard performance (authenticated)
  - name: "Dashboard Performance"
    weight: 25
    flow:
      - get:
          url: "/dashboard"
          headers:
            Cookie: "{{ sessionCookie }}"
      - think: 5
      - get:
          url: "/appointments"
          headers:
            Cookie: "{{ sessionCookie }}"
      - think: 3
      - get:
          url: "/clients"
          headers:
            Cookie: "{{ sessionCookie }}"
      - think: 2

  # Test API endpoints
  - name: "API Load Test"
    weight: 15
    flow:
      - get:
          url: "/api/appointments"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/clients"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2

  # Test static assets
  - name: "Static Assets"
    weight: 10
    flow:
      - get:
          url: "/assets/index.css"
      - get:
          url: "/assets/index.js"
      - get:
          url: "/favicon.ico"